# Негізгі шешілуге тиіс мәселе ол - банк клиенті кредитті қайтарама немесе жоқпа соны деректер базасына сүйене отырып анықтау қажет.

        Клиент банкке кредит алуға өтініш қалдырады, ал банк болса статистикалық модельге сүйене отырып клиентің өтінішін қабылдайды немесе кредит беруден бастартады.Модель осыған дейінгі кредит алған клиенттердің(кредит қайтарған және қайтармаған клиенттер бар) тариғын зерттеп, кредит қайтаратын немесе кредит қайтармайтын кленттердің негізгі факторларын анықтайды.

### ШАГ~1: Негізгі мәселені анықтау
             ШАГ1: Қандай мәселені шешу қажет?
                       Маған жақсы клиентпен нашар клиентті көрсете алатын модель қажет
             ШАГ2: Не үшін мәселе шешілуі қажет?
                       Компания қорынан нашар клиентке кеткен шығынды және ресурстарды(уақыт) азайту үшін.Жақсы
                       клиенттерді сурыптап және соларға коңіл бөліп компанияға келіп түсетін қаражатты ұлғайту.
             ШАГ3: Мен мәселені қалай шешер едім?
                       Алдымен негізгі мәліметтерді зертеймін, сосын дерекқорды талдап, дерекқорды тазартамын.
                       Негізгі белгілерді қарастырып, жақсы клиентпен нашар клиентті табатын модель құрамын.

# ШАГ ~ 1: Мәліметтерді талдау және анализге дайындау.
                 
                 children - Клиенттің бала санын көрсетеді
                 days_employed - Клиенттің жумыс стажы 
                 dob_years - Клиенттің жасы
                 education - Клиенттің білімі 
                 family_status - Отбасылық жағдайы 
                 gender - жынысы
                 income_type - Клиент табысының түрі 
                 total_income - Клиенттің жалпы табысы
                 purpose - кредит алу мақсаты

### Кезең 1 ~ Дерекқорды аламыз және негізгі кітапханаларды шақырамыз

In [141]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from statistics import *

%matplotlib inline
import warnings
warnings.simplefilter('ignore')
from pymystem3 import Mystem
from collections import Counter 
import pprint

##### Дерекқорды оқыймыз

In [2]:
credit_df = pd.read_csv('/home/bakytzhan/IProject/DataAnalysis/Data/Credit.csv')

In [3]:
credit_df.head() #Бастапқы баған мен жолақшаларды көру

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья
1,1,-4024.803754,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля
2,0,-5623.422610,33,Среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья
3,3,-4124.747207,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование
4,0,340266.072047,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу

In [4]:
credit_df.shape

(21525, 12)

In [5]:
credit_df.columns

Index(['children', 'days_employed', 'dob_years', 'education', 'education_id',
       'family_status', 'family_status_id', 'gender', 'income_type', 'debt',
       'total_income', 'purpose'],
      dtype='object')

In [6]:
credit_df.describe()

,children,days_employed,dob_years,education_id,family_status_id,debt,total_income
count,21525.000000,19351.000000,21525.000000,21525.000000,21525.000000,21525.000000,1.935100e+04
mean,0.538908,63046.497661,43.293380,0.817236,0.972544,0.080883,1.674223e+05
std,1.381587,140827.311974,12.574584,0.548138,1.420324,0.272661,1.029716e+05
min,-1.000000,-18388.949901,0.000000,0.000000,0.000000,0.000000,2.066726e+04
25%,0.000000,-2747.423625,33.000000,1.000000,0.000000,0.000000,1.030532e+05
50%,0.000000,-1203.369529,42.000000,1.000000,0.000000,0.000000,1.450179e+05
75%,1.000000,-291.095954,53.000000,1.000000,1.000000,0.000000,2.034351e+05
max,20.000000,401755.400475,75.000000,4.000000,4.000000,1.000000,2.265604e+06

In [7]:
credit_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [8]:
credit_df.isnull().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

### Қорытынды:
                    - children бағанында мин = -1 мәнін өзгерту қажет(бала саны теріс нәтиже болмайды)
                    - days_employed бағанындағы теріс нәтижелерді өзгерту қажет(жумыс стажы теріс мән болмайды)
                    - education бағанындағы регистірді бір стандартқа келтіру қажет 
                    - баған аттарын өзгерту қажет(бағанды сипаттайтын ат беру қажет)
                    - days_employed бағанын бүтін санға келтіру қажет
                    - days_employed бағанын жылдық түрге ауыстырған жөн
                    - education, education_id, family_status, family_status_id - признактырының мәні бірдей
                    - days_employed бағанындағы nun мәнін ауыстыру қажет
                    - total_income бағанындағы nun мәнін ауыстыру қажет

### Кезең 2 ~ Деректерді өңдейміз

In [9]:
credit_df['children'].value_counts()

 0     14149
 1      4818
 2      2055
 3       330
 20       76
-1        47
 4        41
 5         9
Name: children, dtype: int64

In [10]:
# children - бағанындағы (-1) және (20) шындыққа жақын емес.(-1) - санын 1 - санына ауыстырамын.
credit_df['children'] = credit_df['children'].replace(-1, 1)

In [11]:
credit_df['children'].value_counts() # тексеру

0     14149
1      4865
2      2055
3       330
20       76
4        41
5         9
Name: children, dtype: int64

In [12]:
# children бағанындағы (20) - шындыққа сай келмейді, сондықтан (20) - мәнін орташа мәнге немесе медианнаға ауыстыруға болады.
# mean = 5, median = 0.P(0) > P(5) - сондықтан (20) - мәнін 0 - ге ауыстырдым.(P - ықтималдық)
credit_df['children'] = credit_df['children'].replace(20, 0)
print(' Орташа мәні: {0} \n Медианна мәні: {1}'.format(mean, median))

 Орташа мәні: <function mean at 0x7f594e01e7a0>
 Медианна мәні: <function median at 0x7f594e01e8c0>

In [13]:
# days_employed бағанындағы теріс мәндерді өзгерттім
credit_df['days_employed'] = pd.Series([abs(i) for i in credit_df['days_employed']])

In [14]:
# education - бағанындағы барлық жолды төменгі регистірге өзгерттім
credit_df['education'] = pd.Series(map(str.lower, credit_df['education']))

In [15]:
credit_df.columns

Index(['children', 'days_employed', 'dob_years', 'education', 'education_id',
       'family_status', 'family_status_id', 'gender', 'income_type', 'debt',
       'total_income', 'purpose'],
      dtype='object')

In [16]:
# баған аттарын өзгерттім
columns = ['count_of_children',
        'days_employed',
        'client_age_in_years',
        'education_level',
        'education_level_id',
        'family_status',
        'family_status_id',
        'gender',
        'employment_type',
        'credit_repayment_status',
        'monthly_income',
        'credit_purpose'
       ]
credit_df.set_axis(columns, axis='columns', inplace=True)

In [17]:
credit_df.columns.tolist()

['count_of_children',
 'days_employed',
 'client_age_in_years',
 'education_level',
 'education_level_id',
 'family_status',
 'family_status_id',
 'gender',
 'employment_type',
 'credit_repayment_status',
 'monthly_income',
 'credit_purpose']

In [18]:
int(round(9.5))

10

In [19]:
# days_employed бағанындағы nan мәнін 0 - ге ауыстырдым.days_employed бағаны клиентке кредит шешіміне өте қатты әсер етеді, сондықтан nan мәнін орташа мәнге ауыстыруға болмайды. 
credit_df['days_employed'] = credit_df['days_employed'].replace(np.nan, 0)

In [20]:
def func(x):
    return int(round(x))
credit_df['days_employed'] = pd.Series(map(func, credit_df['days_employed']))

In [21]:
credit_df['days_employed']

0          8438
1          4025
2          5623
3          4125
4        340266
          ...
21520      4529
21521    343937
21522      2113
21523      3112
21524      1985
Name: days_employed, Length: 21525, dtype: int64

In [22]:
credit_df.head()

,count_of_children,days_employed,client_age_in_years,education_level,education_level_id,family_status,family_status_id,gender,employment_type,credit_repayment_status,monthly_income,credit_purpose
0,1,8438,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья
1,1,4025,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля
2,0,5623,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья
3,3,4125,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование
4,0,340266,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу

In [23]:
# client_age_in_years бағанындағы 0 - санын орташа мәнге ауыстырамыз(mean >= 18 өйткені кредит 18 жастан бастап беріледі).
means = int(round(credit_df['client_age_in_years'].mean()))
credit_df['client_age_in_years'] = credit_df['client_age_in_years'].replace(0, means)

In [24]:
credit_df['days_employed'].describe()

count     21525.000000
mean      60156.418165
std      133355.928643
min           0.000000
25%         611.000000
50%        1808.000000
75%        4780.000000
max      401755.000000
Name: days_employed, dtype: float64

In [27]:
# days_employed бағанындағы max - мәні(401755) жындыққа жанаспайды.Егер біз ең үлкен клиентті алып, және
# клиент 16(Қазақстан Республикасының заңы бойынша 16 жастан бастап жұмыс істеуге болады) жастан бастап жумыс
# істеді деп бағаласақ, онда клиенттің максималды жумыс істеген күні 21535 күнге тең.
(credit_df['client_age_in_years'].max() - 16) * 365

21535

In [35]:
# days_employed бағанындағы 16 % мәлімет оптималды емес
(credit_df[credit_df['days_employed'] > 21535]['days_employed'].count() * 100) / credit_df.shape[0]

16.004645760743323

In [46]:
# days_employed өшіремін өйткені 16 % қате мәлімет, модельге қатты әсер етеді.
del credit_df['days_employed']

In [51]:
credit_df['education_level'].value_counts()

среднее                15233
высшее                  5260
неоконченное высшее      744
начальное                282
ученая степень             6
Name: education_level, dtype: int64

In [55]:
# gender бағанындағы XNA - мәнін F(Female) - мәніне ауыстырамыз. (P(F) > P(M))
credit_df['gender'].value_counts()
credit_df['gender'] = credit_df['gender'].replace('XNA', 'F')

In [58]:
credit_df['employment_type'].value_counts()

сотрудник          11119
компаньон           5085
пенсионер           3856
госслужащий         1459
предприниматель        2
безработный            2
студент                1
в декрете              1
Name: employment_type, dtype: int64

In [59]:
credit_df.head()

,count_of_children,client_age_in_years,education_level,education_level_id,family_status,family_status_id,gender,employment_type,credit_repayment_status,monthly_income,credit_purpose
0,1,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья
1,1,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля
2,0,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья
3,3,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование
4,0,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу

In [76]:
# monthly_income бағанындағы бос мәндерді анықтаймыз
credit_df['monthly_income'].isnull().value_counts()

False    19351
True      2174
Name: monthly_income, dtype: int64

In [109]:
# monthly_income бағанындағы бос мәндерді орташа мәнге ауыстырамыз.
credit_df['monthly_income'] = credit_df['monthly_income'].replace(np.NaN, credit_df['monthly_income'].mean())

In [113]:
# monthly_income бағанындағы мәндерді бүтін санға ауыстырдым.Клиент табысын бүтін сан ретінде бақылаған ыңғайлы
credit_df['monthly_income'] = credit_df['monthly_income'].astype(int)

In [115]:
# Қайталанған жолдар барма соны тексеремиз
credit_df.duplicated().sum()

71

In [116]:
# Дубликаттарды өшіреміз
credit_df = credit_df.drop_duplicates().reset_index(drop=True)

In [118]:
# Дубликатқа тексеру
credit_df.duplicated().sum()

0

In [119]:
credit_df.head(10)

,count_of_children,client_age_in_years,education_level,education_level_id,family_status,family_status_id,gender,employment_type,credit_repayment_status,monthly_income,credit_purpose
0,1,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875,покупка жилья
1,1,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080,приобретение автомобиля
2,0,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885,покупка жилья
3,3,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628,дополнительное образование
4,0,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616,сыграть свадьбу
5,0,27,высшее,0,гражданский брак,1,M,компаньон,0,255763,покупка жилья
6,0,43,высшее,0,женат / замужем,0,F,компаньон,0,240525,операции с жильем
7,0,50,среднее,1,женат / замужем,0,M,сотрудник,0,135823,образование
8,2,35,высшее,0,гражданский брак,1,F,сотрудник,0,95856,на проведение свадьбы
9,0,41,среднее,1,женат / замужем,0,M,сотрудник,0,144425,покупка жилья для семьи

In [121]:
# credit_purpose бағанындағы уникалды жолдарынан unique_credit_purposes списогін құрамыз 
unique_credit_purposes = credit_df['credit_purpose'].unique().tolist()
unique_credit_purposes

['покупка жилья',
 'приобретение автомобиля',
 'дополнительное образование',
 'сыграть свадьбу',
 'операции с жильем',
 'образование',
 'на проведение свадьбы',
 'покупка жилья для семьи',
 'покупка недвижимости',
 'покупка коммерческой недвижимости',
 'покупка жилой недвижимости',
 'строительство собственной недвижимости',
 'недвижимость',
 'строительство недвижимости',
 'на покупку подержанного автомобиля',
 'на покупку своего автомобиля',
 'операции с коммерческой недвижимостью',
 'строительство жилой недвижимости',
 'жилье',
 'операции со своей недвижимостью',
 'автомобили',
 'заняться образованием',
 'сделка с подержанным автомобилем',
 'получение образования',
 'автомобиль',
 'свадьба',
 'получение дополнительного образования',
 'покупка своего жилья',
 'операции с недвижимостью',
 'получение высшего образования',
 'свой автомобиль',
 'сделка с автомобилем',
 'профильное образование',
 'высшее образование',
 'покупка жилья для сдачи',
 'на покупку автомобиля',
 'ремонт жилью',
 'заняться высшим образованием']

In [136]:
# Mystem класының экземплярын құрамыз
ms = Mystem()
# unique_credit_purposes списокынан strings строкасын аламыз 
strings = ';'.join(unique_credit_purposes)
print(strings)

покупка жилья;приобретение автомобиля;дополнительное образование;сыграть свадьбу;операции с жильем;образование;на проведение свадьбы;покупка жилья для семьи;покупка недвижимости;покупка коммерческой недвижимости;покупка жилой недвижимости;строительство собственной недвижимости;недвижимость;строительство недвижимости;на покупку подержанного автомобиля;на покупку своего автомобиля;операции с коммерческой недвижимостью;строительство жилой недвижимости;жилье;операции со своей недвижимостью;автомобили;заняться образованием;сделка с подержанным автомобилем;получение образования;автомобиль;свадьба;получение дополнительного образования;покупка своего жилья;операции с недвижимостью;получение высшего образования;свой автомобиль;сделка с автомобилем;профильное образование;высшее образование;покупка жилья для сдачи;на покупку автомобиля;ремонт жилью;заняться высшим образованием <class 'str'>

In [142]:
# метод lemmatize бұл сөзді негізгі бастапқы формасына айналдыру процесі.
lem = ms.lemmatize(strings)
pprint.pprint(Counter(lem))

Counter({' ': 59,
         ';': 37,
         'покупка': 10,
         'недвижимость': 10,
         'автомобиль': 9,
         'образование': 9,
         'жилье': 7,
         'с': 5,
         'операция': 4,
         'на': 4,
         'свой': 4,
         'свадьба': 3,
         'строительство': 3,
         'получение': 3,
         'высокий': 3,
         'дополнительный': 2,
         'для': 2,
         'коммерческий': 2,
         'жилой': 2,
         'подержать': 2,
         'заниматься': 2,
         'сделка': 2,
         'приобретение': 1,
         'сыграть': 1,
         'проведение': 1,
         'семья': 1,
         'собственный': 1,
         'со': 1,
         'профильный': 1,
         'сдача': 1,
         'ремонт': 1,
         '\n': 1})

#### Кредит мақсатын мынандай категорияға бөлуге болады:
            - жылжымайтын мүлік
            - автокөлік
            - білім алу
            - той

### Кезең ~ 3 Бизнесті қызықтыратын сурақтарға жауап іздейміз
                
                - Жалақы мөлшері мен кредитті уақытында қайтару процесі арасында байланыс барма?
                - Кредит алу мақсаты кредиттің қайтарылуына әсер етеме?
                - Бала саны мен кредиттің уақытында қайтарылуы процесі арасында байланыс барма?
                - Отбасылық жағдай мен кредиттің уақытында қайтарылуы процесі арасында байланыс барма?

Жалақы мөлшері мен кредитті уақытында қайтару процесі арасында байланыс барма?#####

In [147]:
credit_df['monthly_income']

0        253875
1        112080
2        145885
3        267628
4        158616
          ...
21449    224791
21450    155999
21451     89672
21452    244093
21453     82047
Name: monthly_income, Length: 21454, dtype: int64

In [148]:
# 25%, 50%, 75% деректердің шекарасын көрейік
credit_df['monthly_income'].quantile([0.25, 0.5, 0.75])

0.25    107623.00
0.50    156043.50
0.75    195813.25
Name: monthly_income, dtype: float64

In [150]:
# Жалақы дәрежесі бойынша 4 топқа бөлемін
def monthly_income_status(salary):
    if salary <= 107623.00:
        return 'Төмен дәрежелі жалақы'
    if salary <= 156043.50:
        return 'Орташа дәрежелі жалақы'
    if salary <= 195813.25:
        return 'Жоғары дәрежелі жалақы'
    return 'Өте жоғары дәрежелі жалақы'

In [151]:
credit_df['income_status'] = credit_df['monthly_income'].apply(monthly_income_status)

In [154]:
credit_df.head()

,count_of_children,client_age_in_years,education_level,education_level_id,family_status,family_status_id,gender,employment_type,credit_repayment_status,monthly_income,credit_purpose,income_status
0,1,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875,покупка жилья,Өте жоғары дәрежелі жалақы
1,1,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080,приобретение автомобиля,Орташа дәрежелі жалақы
2,0,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885,покупка жилья,Орташа дәрежелі жалақы
3,3,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628,дополнительное образование,Өте жоғары дәрежелі жалақы
4,0,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616,сыграть свадьбу,Жоғары дәрежелі жалақы

In [145]:
credit_df['credit_repayment_status'].value_counts()

0    19713
1     1741
Name: credit_repayment_status, dtype: int64

###